1s/ERP/Conf/Documents/Лико_ЗабраковкаМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗабраковкаМатериалов</Name>
			<Comment>++ kit:mih web 08.07.21</Comment>
			<BasedOn>
				<xr:Item>Document.ТС_ЗаявкаНаРемонтРабочихЦентров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_БракСерий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распоряжение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОбнаружения</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_МестаОбнаруженияБракаМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОбнаружившийБрак</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дефект</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ДефектыМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДефекта</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РешенияПоБракуМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКРешению</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПринявшийРешение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОформившийОбразец</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРезкиМатериала</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акт</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ПередачаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПретензии</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусыПретензийПоставщикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыставленияПретензии</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОжиданияОтвета</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВозвратаПоставщику</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыВозвратовПоставщикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБрака</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончательноеРешение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетражКВМ</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетражСтрокой</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоПоРешениюОтправлено</Name>
					<Comment>//++ kit:mih web 14.07.21  - Технический реквизит используется для отслеживания отправлено ли письмо на почту</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоКладовщикамОтправлено</Name>
					<Comment>//++ kit:mih web 14.07.21  - Технический реквизит используется для отслеживания отправлено ли письмо на почту</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>//Технический реквизит, необходим хранения документа основания</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНовыйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбразцыПриложеныКНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетражПМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныеНомераРоликов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетражПМ</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетражКВМ</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_БракСерий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_БракСерий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дефект</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ДефектыМатериалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеДефекта</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Решение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РешенияПоБракуМатериалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийКРешению</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбъектНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗабраковкаМатериалов</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_УстановкаВидаНастроечногоМатериала</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_РешенияПоБракуМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_РешенияПоБракуМатериалов</Name>
			<Comment>++ kit:mih web 08.07.21</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Контакты</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗабраковкаМатериалов/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТС_ЗаявкаНаРемонтРабочихЦентров") Тогда	
		
		СотрудникОбнаружившийБрак = ДанныеЗаполнения.Автор;
		ЗаказКлиента = ДанныеЗаполнения.ЗаказКлиента;
		Организация = ДанныеЗаполнения.РабочийЦентр.Лико_Площадка.Организация;
		РабочийЦентр = ДанныеЗаполнения.РабочийЦентр;
		Распоряжение = ДанныеЗаполнения.Ссылка;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Проведен И НЕ ЗначениеЗаполнено(РабочийЦентр) И НЕ ЗначениеЗаполнено(МестоОбнаружения) Тогда
		Отказ = Истина;
		Сообщить(?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + ": ", ""), + "Необходимо заполнить рабочий центр или место обнаружения");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если Проведен Тогда
		ТЗНоменклатур = Материалы.Выгрузить(,"Номенклатура");
		ТЗНоменклатур.Свернуть("Номенклатура");
		Если ТЗНоменклатур.Количество() > 1 Тогда
			Отказ = Истина;
			Сообщить(?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + ": ", "") + "В одном документе не могут содержаться материалы с разной номенклатурой");
		КонецЕсли;
	КонецЕсли;
	
	МетражСтрокой = "";
	МетражКВМ = 0;
	МетражПМ = 0;
	УникальныеНомераРоликов = "";
	Для Каждого Строка Из Материалы Цикл
		МетражКВМ = МетражКВМ + Строка.МетражКВМ;
		МетражПМ = МетражПМ + Строка.МетражПМ;
		МетражСтрокой = МетражСтрокой + ?(ЗначениеЗаполнено(МетражСтрокой), "; ", "") +  ?(ЗначениеЗаполнено(Строка.Нарезка), "" + Строка.Нарезка + " - ", "") +  Строка.МетражКВМ;
		ТекНомерРолика = Формат(Строка.Серия.ЯССМ_ОбъектНоменклатуры.НомерПоставки, "ЧГ=0");
		Если НЕ ЗначениеЗаполнено(ТекНомерРолика) Тогда
			ТекНомерРолика = "не заполнен";
		КонецЕсли;
		УникальныеНомераРоликов = ?(ЗначениеЗаполнено(УникальныеНомераРоликов), УникальныеНомераРоликов + ", " + ТекНомерРолика, ТекНомерРолика); 
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.ПисьмоПоРешениюОтправлено И Ссылка.Решение <> Решение Тогда
		ПисьмоПоРешениюОтправлено = Ложь;
	КонецЕсли; 
	// -->  Субботин 29.11.2022 
	Если Материалы.Количество() > 0 Тогда
		Номенклатура = Материалы[0].Номенклатура;
	КонецЕсли;
	// <--  Субботин 29.11.2022 
	
	
	ПроверитьЦены();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Неопределено;
	Распоряжение = Неопределено;
	СотрудникОбнаружившийБрак = Неопределено;
	СотрудникПринявшийРешение = Неопределено;
	СотрудникОформившийОбразец = Неопределено;
	Акт = Неопределено;
	СтатусПретензии = Неопределено;
	ДатаВыставленияПретензии = Неопределено;
	ДатаОжиданияОтвета = Неопределено;
	ТипВозвратаПоставщику = Неопределено;
	СуммаБрака = Неопределено;
	ОкончательноеРешение = Неопределено;
	ДатаВыполнения = Неопределено;
	МетражКВМ = Неопределено;
	МетражСтрокой = Неопределено;
	ПисьмоПоРешениюОтправлено = Неопределено;
	ПисьмоКладовщикамОтправлено = Неопределено;
	ДокументОснование = Неопределено;
	ЭтоНовыйДокумент = Неопределено;
	ОбразцыПриложеныКНП = Неопределено;
	МетражПМ = Неопределено;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//+ ---> Лико m.shenderov 12.12.2022
	УстановитьПривилегированныйРежим(Истина);	
	Движения.Лико_БракСерий.Записывать = Истина;
	
	Для каждого Материал Из Материалы  Цикл 
		
		Движение 						=	Движения.Лико_БракСерий.Добавить();
		Движение.Серия					=	Материал.Серия;
		Движение.ОбъектНоменклатуры		=	Материал.Серия.ЯССМ_ОбъектНоменклатуры;
		Движение.Дефект					=	Дефект;
		Движение.Документ				=	Ссылка;
		Движение.ОписаниеДефекта		= 	ОписаниеДефекта;  
		Движение.Решение				=	Решение;
		Движение.КомментарийКРешению	= 	КомментарийКРешению;
		
		
		
	КонецЦикла; 	
	//- <--- Лико m.shenderov 12.12.2022	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Решение=Справочники.Лико_РешенияПоБракуМатериалов.ПеревестиНаК2 Тогда
		ПроверяемыеРеквизиты.Добавить("ОписаниеДефекта");
	КонецЕсли;
	
	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	
	
КонецПроцедуры

Процедура ПроверитьЦены() //+Лико m.shenderov 10.05.2023
	УстановитьПривилегированныйРежим(Истина);
	ЕстьИзменения=Ложь; 
	ВалютаНомененклатуры=Неопределено;
	Итого=0; 
	ДокументПоступления=Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();
	
	Для каждого Материал Из Материалы Цикл
		
		Если Не ЗначениеЗаполнено(Материал.Цена) Тогда
			
			СтруктураЦены=Документы.Лико_ЗабраковкаМатериалов.ПолучитьЦену(Материал.Номенклатура,Организация,Дата);
			
			Если ЗначениеЗаполнено(СтруктураЦены.Цена) Тогда
				
				Материал.Цена=СтруктураЦены.Цена;
				ВалютаНомененклатуры=СтруктураЦены.Валюта;
				ЕстьИзменения=Истина;
			КонецЕсли;
			
			
		КонецЕсли;  		 
		
		Итого=Итого+(Материал.Цена*Материал.МетражКВМ);
		
		
		ДокументПоступления=Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();
		Если не ЗначениеЗаполнено(Поставщик) Тогда
			Если Материал.Серия<>Неопределено и Материал.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный Тогда
				
				Лико_ОбщегоНазначенияСервер.НайтиДокументПоступления(ДокументПоступления,Организация,Материал.Серия,Дата); 
				Если ЗначениеЗаполнено(ДокументПоступления)  Тогда
					Поставщик=ДокументПоступления.Контрагент;
				КонецЕсли;
				
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьИзменения Тогда
		Валюта=ВалютаНомененклатуры;
		СуммаБрака=Итого;
		
	КонецЕсли;
	
	
	
КонецПроцедуры //-Лико m.shenderov 10.05.2023
